In [66]:
import pandas as pd
import numpy as np

In [67]:
from pymove.preprocessing import filter
from pymove.utils import utils

In [80]:
from pymove.utils import transformations

In [77]:
df = pd.read_csv('geolife_sample.csv', parse_dates=['datetime'])
df.head()

         lat         lon            datetime  id
0  39.984094  116.319236 2008-10-23 05:53:05   1
1  39.984094  116.319236 2008-10-23 05:53:05   1
2  39.984198  116.319322 2008-10-23 05:53:06   1
3  39.984224  116.319402 2008-10-23 05:53:11   1
4  39.984211  116.319389 2008-10-23 05:53:16   1

In [78]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217654 entries, 0 to 217653
Data columns (total 4 columns):
lat         217654 non-null float64
lon         217654 non-null float64
datetime    217654 non-null datetime64[ns]
id          217654 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 6.6 MB

In [14]:
bbox = utils.get_bbox(df)
bbox

(22.147577, 113.54884299999999, 41.132062, 121.156224)

In [15]:
filter.filter_bbox(df, bbox)

              lat         lon            datetime  id
0       39.984094  116.319236 2008-10-23 05:53:05   1
1       39.984198  116.319322 2008-10-23 05:53:06   1
2       39.984224  116.319402 2008-10-23 05:53:11   1
3       39.984211  116.319389 2008-10-23 05:53:16   1
4       39.984217  116.319422 2008-10-23 05:53:21   1
...           ...         ...                 ...  ..
217648  39.999896  116.327290 2009-03-19 05:46:02   5
217649  39.999899  116.327352 2009-03-19 05:46:07   5
217650  39.999945  116.327394 2009-03-19 05:46:12   5
217651  40.000015  116.327433 2009-03-19 05:46:17   5
217652  39.999978  116.327460 2009-03-19 05:46:37   5

[217653 rows x 4 columns]

In [16]:
filter.filter_by_datetime(df,"2009-03-19 05:45:37", "2009-03-19 05:46:17")

              lat         lon            datetime  id
217644  40.000128  116.327171 2009-03-19 05:45:42   5
217645  40.000069  116.327179 2009-03-19 05:45:47   5
217646  40.000001  116.327219 2009-03-19 05:45:52   5
217647  39.999919  116.327211 2009-03-19 05:45:57   5
217648  39.999896  116.327290 2009-03-19 05:46:02   5
217649  39.999899  116.327352 2009-03-19 05:46:07   5
217650  39.999945  116.327394 2009-03-19 05:46:12   5
217651  40.000015  116.327433 2009-03-19 05:46:17   5

In [17]:
filter.filter_by_label(df, 116.327219, "lon")

              lat         lon            datetime  id
3066    39.979160  116.327219 2008-10-24 06:34:27   1
13911   39.975424  116.327219 2008-10-26 08:18:06   1
16396   39.980411  116.327219 2008-10-27 00:30:47   1
33935   39.975832  116.327219 2008-11-05 11:04:04   1
41636   39.976990  116.327219 2008-11-07 10:34:41   1
50207   39.990137  116.327219 2008-11-11 00:09:21   1
85401   39.978748  116.327219 2008-12-08 14:29:25   1
86761   39.979981  116.327219 2008-12-09 01:08:51   1
88648   39.977393  116.327219 2008-12-09 02:46:19   1
107805  39.980398  116.327219 2008-12-14 11:26:34   1
107806  39.980452  116.327219 2008-12-14 11:26:39   1
120765  39.999796  116.327219 2008-10-28 05:20:01   5
128460  39.991738  116.327219 2008-10-31 13:26:09   5
139981  40.000522  116.327219 2008-11-04 05:23:47   5
141138  39.999739  116.327219 2008-11-06 16:23:31   5
141142  39.999750  116.327219 2008-11-06 16:23:46   5
143580  39.999855  116.327219 2008-11-09 06:18:32   5
165704  40.000577  116.327219 2008-11-25 02:40:17   5
165958  40.000560  116.327219 2008-11-25 03:21:57   5
183794  40.000966  116.327219 2009-01-13 16:51:43   5
216394  40.000981  116.327219 2009-02-28 03:55:25   5
216892  39.991858  116.327219 2009-03-12 15:58:57   5
217646  40.000001  116.327219 2009-03-19 05:45:52   5

In [18]:
filter.filter_by_label(df, "2008-10-24 04:12:30" , "datetime")

              lat         lon            datetime  id
2428    39.977908  116.326569 2008-10-24 04:12:30   1
108607  40.004155  116.321337 2008-10-24 04:12:30   5

In [ ]:
filter.filter_by_label(df, "2008-10-24 04:12:30" , "datetime", filter_out=True)

In [ ]:
filter.filter_by_id(df, 5)

In [ ]:
transformations.create_update_tid_based_on_id_datatime(df)

In [ ]:
df.head()

In [ ]:
filter.filter_by_tid(df, "12008102305")

In [29]:
teste = filter.clean_duplicates(df)
print(teste)

Remove rows duplicates by subset
...Sorting by id and datetime to increase performance

...There are 1 GPS points duplicated
None

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 217654 entries, 0 to 217653
Data columns (total 4 columns):
lat         217654 non-null float64
lon         217654 non-null float64
datetime    217654 non-null datetime64[ns]
id          217654 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 8.3 MB

In [49]:
#perguntar Nickson
df_clean_cons_duplicates = filter.clean_consecutive_duplicates(df, subset = ["lat"])
df_clean_cons_duplicates.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 196142 entries, 0 to 217653
Data columns (total 4 columns):
lat         196142 non-null float64
lon         196142 non-null float64
datetime    196142 non-null datetime64[ns]
id          196142 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 7.5 MB

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 217654 entries, 0 to 217653
Data columns (total 4 columns):
lat         217654 non-null float64
lon         217654 non-null float64
datetime    217654 non-null datetime64[ns]
id          217654 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 6.6 MB

In [21]:
df_clean_cons_duplicates.head()

         lat         lon            datetime  id
1  39.984094  116.319236 2008-10-23 05:53:05   1
2  39.984198  116.319322 2008-10-23 05:53:06   1
3  39.984224  116.319402 2008-10-23 05:53:11   1
4  39.984211  116.319389 2008-10-23 05:53:16   1
5  39.984217  116.319422 2008-10-23 05:53:21   1

In [55]:
teste = filter.clean_NaN_values(df)

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 217654 entries, 0 to 217653
Data columns (total 4 columns):
lat         217654 non-null float64
lon         217654 non-null float64
datetime    217654 non-null datetime64[ns]
id          217654 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 8.3 MB

In [54]:
print(teste)

None

In [81]:
transformations.create_update_tid_based_on_id_datatime(df)

Creating or updating tid feature...

...Sorting by id and datetime to increase performance


...tid feature was created...

In [82]:
filter.clean_trajectories_with_few_points(df)

...There are 4 ids with few points

...Tids before drop: 625

...Tids after drop: 621

...Shape - before drop: (217654, 5) - after drop: (217650, 5)

NameError: name 'create_update_dist_time_speed_features' is not defined